/*=======================================================================================
[팩토리얼]
자연수 N을 입력하면 N!값을 구하라.
N! = n*(n-1)*(n-2)*.....*2*1 이다.
만약 N=5 라면 5!=5*4*3*2*1=120 이다.
=======================================================================================*/

// ▣ 입력설명
// 첫째 줄에 자연수 N(3<=n<=10)이 입력된다.

// ▣ 출력설명
// 첫째 줄에 N팩토리얼 값을 출력한다.

// ▣ 입력예제 1
// 5

// ▣ 출력예제 1
// 120

function solution(n) {
  function DFS(v) {
    if (v === 1) return v;

    return v * DFS(v - 1);
  }

  return DFS(n);
}

/**
 * ========================================================
 * @Title       : 11_팩토리얼
 * @Path        : javascript\02_Solved\inflearn\h.recursion\11_팩토리얼.spec.js
 * @Description :
 * @Date        : 2021-07-13 12:20:08
 * --------------------------------------------------------
 * @Author      : Inseong-so(https://github.com/inseong-so)
 * ========================================================
 */
describe('11_팩토리얼', () => {
  // 테스트 케이스명
  it('기본1', () => {
    // 파라미터 정의
    let k = 5;
    const result = 120;

    // 테스트 결과 정의
    expect(solution(k)).toEqual(result);
  });
});
