/*=======================================================================================
[재귀함수]
자연수 N이 입력되면 재귀함수를 이용하여 1부터 N까지를 출력하는 프로그램을 작성하라.
=======================================================================================*/

// ▣ 입력설명
// 첫 번째 줄은 정수 N(3<=N<=10)이 입력된다.

// ▣ 출력설명
// 첫째 줄에 출력한다.

// ▣ 입력예제 1
// 3

// ▣ 출력예제 1
// 1 2 3

function solution(n) {
  let answer = [];
  function DFS(l) {
    if (l === 0) {
      return answer;
    } else {
      answer.push(l);
      DFS(l - 1);
    }
  }

  DFS(n);

  return answer.sort((a, b) => a - b);
}

/**
 * ========================================================
 * @Title       : 01_재귀함수
 * @Path        : javascript\02_Solved\inflearn\h.recursion\01_재귀함수.spec.js
 * @Description :
 * @Date        : 2021-07-13 11:29:35
 * --------------------------------------------------------
 * @Author      : Inseong-so(https://github.com/inseong-so)
 * ========================================================
 */
describe('01_재귀함수', () => {
  // 테스트 케이스명
  it('기본1', () => {
    // 파라미터 정의
    let k = 3;
    const result = [1, 2, 3];

    // 테스트 결과 정의
    expect(solution(k)).toEqual(result);
  });
});
