/*=======================================================================================
[올바른 괄호]
괄호가 입력되면 올바른 괄호이면 “YES", 올바르지 않으면 ”NO"를 출력한다.
(())() 이것은 괄호의 쌍이 올바르게 위치하는 거지만, (()()))은 올바른 괄호가 아니다.
=======================================================================================*/

// ▣ 입력설명
// 첫 번째 줄에 괄호 문자열이 입력된다. 문자열의 최대 길이는 30이다.

// ▣ 출력설명
// 첫 번째 줄에 YES, NO를 출력한다.

// ▣ 입력예제 1
// (()(()))(()

// ▣ 출력예제 1
// NO

function solution(s) {
  let answer = 'YES';
  let stack = [];

  for (let item of s) {
    if (item === '(') {
      stack.push(item);
    } else {
      if (stack.length === 0) return 'NO';
      stack.pop();
    }
  }

  if (stack.length > 0) return 'NO';

  return answer;
}

/**
 * ========================================================
 * @Title       : 01_올바른_괄호
 * @Path        : javascript\02_Solved\inflearn\f.stackANDqueue\01_올바른_괄호.spec.js
 * @Description :
 * @Date        : 2021-07-12 21:31:05
 * --------------------------------------------------------
 * @Author      : Inseong-so(https://github.com/inseong-so)
 * ========================================================
 */
describe('01_올바른_괄호', () => {
  // 테스트 케이스명
  it('기본1', () => {
    // 파라미터 정의
    let a = '(()(()))(()';
    const result = 'NO';

    // 테스트 결과 정의
    expect(solution(a)).toEqual(result);
  });
});
