/*=======================================================================================
[괄호문자제거]
입력된 문자열에서 소괄호 ( ) 사이에 존재하는 모든 문자를 제거하고 남은 문자만 출력하는 프로그램을 작성하라.
=======================================================================================*/

// ▣ 입력설명
// 첫 줄에 문자열이 주어진다. 문자열의 길이는 100을 넘지 않는다.

// ▣ 출력설명
// 남은 문자만 출력한다.

// ▣ 입력예제 1
// (A(BC)D)EF(G(H)(IJ)K)LM(N)

// ▣ 출력예제 1
// EFLM

function solution(s) {
  let stack = [];
  for (let item of s) {
    if (item === ')') {
      while (stack.pop() !== '(');
    } else {
      stack.push(item);
    }
  }

  return stack.join('');
}

/**
 * ========================================================
 * @Title       : 02_괄호문자제거
 * @Path        : javascript\02_Solved\inflearn\f.stackANDqueue\02_괄호문자제거.spec.js
 * @Description :
 * @Date        : 2021-07-12 21:32:21
 * --------------------------------------------------------
 * @Author      : Inseong-so(https://github.com/inseong-so)
 * ========================================================
 */
describe('02_괄호문자제거', () => {
  // 테스트 케이스명
  it('기본1', () => {
    // 파라미터 정의
    let str = '(A(BC)D)EF(G(H)(IJ)K)LM(N)';
    const result = 'EFLM';

    // 테스트 결과 정의
    expect(solution(str)).toEqual(result);
  });
});
